## Summary :
- convert the column into datetime type 
- use datetime library to get desired things

In [72]:
import pandas as pd
import numpy as np
import datetime as dt

In [73]:
date = pd.read_csv(r"C:\Users\Admin\Documents\Jupyter Notebook\Machine Learning (CampusX)\Dataset\orders.csv")

In [74]:
time = pd.read_csv(r"C:\Users\Admin\Documents\Jupyter Notebook\Machine Learning (CampusX)\Dataset\messages.csv")

In [75]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [76]:
msg.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [77]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [78]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

## Working with date

In [79]:
date['date'] = pd.to_datetime(date['date'])

In [80]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## Extract Year

In [81]:
date['date_year'] = date['date'].dt.year
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

## Extract Month

In [82]:
date['date_month'] = date['date'].dt.month

## Extract Month Name

In [83]:
date['date_month_name'] = date['date'].dt.month_name()

## Extract Day

In [84]:
date['date_day'] = date['date'].dt.day

## Extract week

In [85]:
# Assign week number to a new column
date['date_week'] = date['date'].dt.isocalendar().week

## Extract date of week

In [86]:
date['date_dow'] = date['date'].dt.dayofweek

In [87]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_week,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,50,1
1,2018-08-15,3646,14,157,2018,8,August,15,33,2
2,2018-10-23,1859,25,1,2018,10,October,23,43,1
3,2019-08-17,7292,25,1,2019,8,August,17,33,5
4,2019-01-06,4344,25,3,2019,1,January,6,1,6

## Extract date of week

In [88]:
date['date_dow_name'] = date['date'].dt.day_name()  #0 -mon, 6-sunday

In [89]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_week,date_dow,date_dow_name
0,2019-12-10,5628,25,3,2019,12,December,10,50,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,33,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,43,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,33,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,1,6,Sunday

## is weekend?

In [90]:
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday','Saturday']),1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_week,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,50,1,Tuesday,0
1,2018-08-15,2018,8,August,15,33,2,Wednesday,0
2,2018-10-23,2018,10,October,23,43,1,Tuesday,0
3,2019-08-17,2019,8,August,17,33,5,Saturday,1
4,2019-01-06,2019,1,January,6,1,6,Sunday,1

## Extract the week of the year

In [91]:
# date['date_week_in_no'] = date['date'].dt.week()   ## no longer works
date['date_week_in_no'] = date['date'].dt.isocalendar().week

In [92]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_week,date_dow,date_dow_name,date_is_weekend,date_week_in_no
0,2019-12-10,5628,25,3,2019,12,December,10,50,1,Tuesday,0,50
1,2018-08-15,3646,14,157,2018,8,August,15,33,2,Wednesday,0,33
2,2018-10-23,1859,25,1,2018,10,October,23,43,1,Tuesday,0,43
3,2019-08-17,7292,25,1,2019,8,August,17,33,5,Saturday,1,33
4,2019-01-06,4344,25,3,2019,1,January,6,1,6,Sunday,1,1

In [93]:
date['Quarter'] = date['date'].dt.quarter

In [94]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_week,date_dow,date_dow_name,date_is_weekend,date_week_in_no,Quarter
0,2019-12-10,5628,25,3,2019,12,December,10,50,1,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,8,August,15,33,2,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,10,October,23,43,1,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,8,August,17,33,5,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,1,January,6,1,6,Sunday,1,1,1

# Semester

In [95]:
date['Semester'] = np.where(date['Quarter'].isin([3,4]),2,1)

In [96]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_week,date_dow,date_dow_name,date_is_weekend,date_week_in_no,Quarter,Semester
0,2019-12-10,5628,25,3,2019,12,December,10,50,1,Tuesday,0,50,4,2
1,2018-08-15,3646,14,157,2018,8,August,15,33,2,Wednesday,0,33,3,2
2,2018-10-23,1859,25,1,2018,10,October,23,43,1,Tuesday,0,43,4,2
3,2019-08-17,7292,25,1,2019,8,August,17,33,5,Saturday,1,33,3,2
4,2019-01-06,4344,25,3,2019,1,January,6,1,6,Sunday,1,1,1,1

## Extract Time elpaed between dates

In [97]:
import datetime
today = datetime.datetime.today()

today

datetime.datetime(2024, 10, 30, 12, 4, 5, 923688)

In [98]:
today - date['date']

0     1786 days 12:04:05.923688
1     2268 days 12:04:05.923688
2     2199 days 12:04:05.923688
3     1901 days 12:04:05.923688
4     2124 days 12:04:05.923688
                 ...
995   2214 days 12:04:05.923688
996   2155 days 12:04:05.923688
997   2003 days 12:04:05.923688
998   2068 days 12:04:05.923688
999   1842 days 12:04:05.923688
Name: date, Length: 1000, dtype: timedelta64[ns]

In [99]:
(today- date['date']).dt.days

0      1786
1      2268
2      2199
3      1901
4      2124
       ...
995    2214
996    2155
997    2003
998    2068
999    1842
Name: date, Length: 1000, dtype: int64

In [100]:
## Month passed
np.round((today-date['date'])/np.timedelta64(30,'D'),0)   ##change

0      60.0
1      76.0
2      73.0
3      63.0
4      71.0
       ...
995    74.0
996    72.0
997    67.0
998    69.0
999    61.0
Name: date, Length: 1000, dtype: float64

## Time

In [101]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [102]:
time['date'] = pd.to_datetime(time['date'])

In [103]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [104]:
time['hour']= time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [105]:
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [106]:
time['time'] = time['date'].dt.time

In [107]:
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

## Time diffrence

In [108]:
today - time['date']

0     3972 days 11:14:05.923688
1     3836 days 12:24:05.923688
2     4322 days 11:43:05.923688
3     3624 days 11:33:05.923688
4     4021 days 12:53:05.923688
                 ...
995   4611 days 11:14:05.923688
996   3932 days 12:50:05.923688
997   4397 days 12:27:05.923688
998   4513 days 12:30:05.923688
999   3785 days 12:39:05.923688
Name: date, Length: 1000, dtype: timedelta64[ns]

In [109]:
today_time

In [110]:
## In seconds
(today - time['date'])/np.timedelta64(1,'s')

0      3.432212e+08
1      3.314750e+08
2      3.734630e+08
3      3.131552e+08
4      3.474608e+08
           ...
995    3.984308e+08
996    3.397710e+08
997    3.799456e+08
998    3.899682e+08
999    3.270695e+08
Name: date, Length: 1000, dtype: float64

In [111]:
# Minutes
(today - time['date'])/np.timedelta64(1,'m')

0      5.720354e+06
1      5.524584e+06
2      6.224383e+06
3      5.219253e+06
4      5.791013e+06
           ...
995    6.640514e+06
996    5.662850e+06
997    6.332427e+06
998    6.499470e+06
999    5.451159e+06
Name: date, Length: 1000, dtype: float64

In [112]:
## hours
(today - time['date'])/np.timedelta64(1,'h')

0       95339.234979
1       92076.401645
2      103739.718312
3       86987.551645
4       96516.884979
           ...
995    110675.234979
996     94380.834979
997    105540.451645
998    108324.501645
999     90852.651645
Name: date, Length: 1000, dtype: float64